#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 2869                              :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: alstja98 <boj.kr/u/alstja98>                +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/2869                           #+#        #+#      #+#     #
#    Solved: 2025/01/02 21:14:41 by alstja98      ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
import math

def main():
    # 입력 받기
    A, B, V = map(int, input().split())
    
    # 달팽이가 올라가야 할 순수 높이 계산
    # 마지막 날에는 미끄러지지 않으므로 V - B
    # 하루에 순수하게 올라가는 높이는 A - B
    # 필요한 날 수를 올림하여 계산
    days = math.ceil((V - B) / (A - B))
    
    print(days)

if __name__ == "__main__":
    main()