#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 2941                              :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: alstja98 <boj.kr/u/alstja98>                +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/2941                           #+#        #+#      #+#     #
#    Solved: 2025/01/01 17:25:10 by alstja98      ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
# 크로아티아 알파벳 목록 (dz= 먼저 처리)
croatian_alphabets = ['dz=', 'c=', 'c-', 'd-', 'lj', 'nj', 's=', 'z=']

# 입력 받기
word = input()

# 크로아티아 알파벳을 '*'로 대체
for cro_alpha in croatian_alphabets:
    word = word.replace(cro_alpha, '*')

# 최종 문자열의 길이가 크로아티아 알파벳을 고려한 알파벳 개수
print(len(word))